car_les/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;



vertices
(
    (-0.08  -0.1  -0.001)
    ( 0.02  -0.1  -0.001)
    ( 0.02   0.1  -0.001)
    (-0.08   0.1  -0.001)
    (-0.08  -0.1   0.05)
    ( 0.02  -0.1   0.05)
    ( 0.02   0.1   0.05)
    (-0.08   0.1   0.05)
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (10 20 10)
    simpleGrading (0.2 1 5.0)
);


boundary
(
    outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    side1
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    centreline
    {
        type symmetry;
        faces
        (
            (2 6 5 1)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
